<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

//是否开启调试模式
$APP_DEBUG=false;

return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------

    // 异常页面的模板文件
    // 应用调试模式
    'app_debug'              => $APP_DEBUG,
    'exception_tmpl'         => $APP_DEBUG ? THINK_PATH . 'tpl' . DS . 'bjuir404.tpl' : THINK_PATH . 'tpl' . DS . 'bjuir404.tpl',
    'show_error_msg'         => true,
    'exception_handle'       => '',
];
